04_CFD/pipeline/sweep_run/cases/d+0p0_M0p150_aoa+0p0/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (51.045000 0.000000 0);

boundaryField
{
    mainfoil
    {
        type            noSlip;
    }

    flap
    {
        type            noSlip;
    }

    farfield
    {
        // freestream maneja entrada Y salida en la misma cara según el
        // signo local del flujo -- ideal para el borde curvo del dominio C
        type            freestreamVelocity;
        freestreamValue uniform (51.045000 0.000000 0);
    }

    outlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (51.045000 0.000000 0);
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
